<script setup>
const emit = defineEmits()
// Емітимо подію для додавання класу в батьківському компоненті
const closePolicy = () => {
  emit("closePolicyClick")
}
</script>
<template>
  <div class="policy">
    <div class="policy__content">
      <div class="policy__text">
        <h3>Політика конфіденційності</h3>
        <p>
          Ця політика конфіденційності стосується вашого візиту на наш веб-сайт
          https://resume-cv.pp.ua/. Ми не збираємо, не використовуємо та не
          розкриваємо ніякої особистої інформації про вас під час вашого
          перебування на нашому сайті.
        </p>
        <h4>Збір і використання інформації</h4>
        <p>Ми не збираємо особисту інформацію про вас.ї</p>
        <h4>Розкриття інформації третім сторонам</h4>
        <p>
          Оскільки ми не збираємо особисту інформацію про вас, ми не розкриваємо
          її третім сторонам.
        </p>
        <h4>Захист даних</h4>
        <p>
          Хоча ми не збираємо особисту інформацію про вас, ми все ще
          застосовуємо заходи безпеки для захисту вашої конфіденційності під
          часвикористання нашого сайту.
        </p>
        <h4>Зміни до політики конфіденційності</h4>
        <p>
          Ця політика конфіденційності була оновлена 01.03.2024. Ми можемо
          періодично оновлювати цю політику конфіденційності, нова редакція
          політики конфіденційності вступає в силу з моменту її розміщення в
          мережі інтернет за вказаною в цьому пункті адресою, якщо інше не
          передбачено новою редакцією політики конфіденційності. Чинна редакція
          політики конфіденційності завжди знаходиться на сторінці за адресою
          https://resume-cv.pp.ua/. У разі якщо внесені зміни в політику
          конфіденційності, з якими користувач не згоден, він зобов'язаний
          припинити використання сайту. Факт продовження використання сайту є
          підтвердженням згоди і прийняття користувачем відповідної редакції
          Політики Конфіденційності.
        </p>
        <h4>Контактна інформація</h4>
        <p>
          Якщо у вас є питання або зауваження стосовно цієї політики, будь
          ласка, зв'яжіться з нами за адресою https://resume-cv.pp.ua/. Ця
          політика конфіденційності розроблена відповідно до вимог законодавства
          України з питань захисту персональних даних та інших відповідних
          нормативно-правових актів.
        </p>
        <button class="policy__button" @click="closePolicy">ПІДТВЕРДЖУЮ</button>
      </div>
    </div>
  </div>
</template>
<style lang="scss" scoped>
.policy {
  &.open {
    display: block;
  }
  display: none;
  position: absolute;
  z-index: 100;
  top: 0;
  left: 0;
  width: 100%;
  overflow: hidden;
  background-color: rgba(206, 206, 248, 0.1);
  color: #000;
  overflow: hidden;
  &__content {
    margin: 45px 0px 0px 0px;
    width: 100%;
    height: 100%;
    background-color: #fff;
    overflow: hidden;
  }
  &__text {
    margin: 0 auto;
    display: flex;
    flex-direction: column;
    max-width: 768px;
    padding: 50px 20px 50px 20px;

    height: 100%;

    h3 {
      padding: 0px 0px 20px 0px;
      text-align: center;
      font-size: 25px;
    }
    h4 {
      padding: 0px 0px 10px 0px;
      font-size: 20px;
    }
    p {
      padding: 0px 0px 15px 0px;

      text-indent: 10px;
    }
  }
  &__button {
    display: flex;
    margin: 50px 20px 0px 0px;
    padding: 10px 20px;
    background-color: #6f86a0;
    color: #fff;
    font-family: RobotoBoldItalic;
    border-radius: 10px;
    align-self: flex-end;
  }
}
</style>
